use crate::cli::Args;

pub fn print_banner(args: &Args){
  println!(r#"
  ▄████████  ▄█     ▄████████    ▄██████▄     ▄████████
  ███    ███ ███    ███    ███   ███    ███   ███    ███
  ███    █▀  ███▌   ███    █▀    ███    █▀    ███    █▀ 
  ███        ███▌  ▄███▄▄▄      ▄███         ▄███▄▄▄    
  ▀███████████ ███▌ ▀▀███▀▀▀     ▀▀███ ████▄  ▀▀███▀▀▀    
          ███ ███    ███    █▄    ███    ███   ███    █▄ 
  ▄█    ███ ███    ███    ███   ███    ███   ███    ███
  ▄████████▀  █▀     ██████████   ████████▀    ██████████
  "#);

  println!(r#"
[URL]          - {}
[WORDLIST]     - {}
[STATUS CODES] - {:?}
[THREADS]      - {}
[TIMEOUT]      - {} 
  "#, 
  args.url,
  args.wordlist.to_string_lossy(),
  args.status_codes,
  args.threads,
  args.timeout,
  );
}
